#encoding=utf-8

#单位属性代码表
organization = (
    (1,u'军队'),
    (2,u'政府机关'),
    (3,u'事业单位'),
    (4,u'企业'),
    (5,u'个人'),
    (6,u'社会团体'),
    (999,u'其他'),
)

#证件类型代码表
IDType = (
    (1,u'工商营业执照'),
    (2,u'身份证'),
    (3,u'组织机构代码'),
    (4,u'事业法人证'),
    (5,u'军队代号'),
    (6,u'社会法人证'),
    (7,u'护照'),
    (8,u'军官证'),
    (9,u'台胞证'),
    (999,u'其他'),
)

#用户属性
CustomerAttr = (
    (1,u"提供互联网应用服务的用户"),
    (2,u"其他"),
)


#服务内容
ServiceType = (
    (500,u"基础应用"),
    (501,u"网络媒体"),
    (502,u"电子政务、电子商务"),
    (503,u"数字娱乐"),
    (504,u"其他"),
    (1,u"限时通信"),
    (2,u"搜索引擎"),
    (3,u"综合门户"),
    (4,u"网上邮局"),
    (5,u"网络新闻"),
    (6,u"博客/个人空间"),
    (7,u"网络广告信息"),
    (8,u"单位门户网站"),
    (9,u"网络购物"),
    (10,u"网上支持"),
    (11,u"网上银行"),
    (12,u"网上炒股/股票基金"),
    (13,u"网络游戏"),
    (14,u"网络音乐"),
    (15,u"网上影线"),
    (16,u"网上图片"),
    (17,u"网络软件下载"),
    (18,u"网上求职"),
    (19,u"网上交友婚介"),
    (20,u"网上房产"),
    (21,u"网络教育"),
    (22,u"网站建设"),
    (23,u"WAP"),
    (24,u"其它"),
)

#虚拟资源类型
VirtualType = (
    (0,u"虚拟主机"),
    (1,u"虚拟存储"),
    (2,u"应用托管容器"),
    (999,u"其他"),
)

#接入方式
ADSL = (
    (0,u'专线'),
    (1,u'虚拟主机'),
    (2,u'主机托管'),
    (3,u'整机租用'),
    (999,u'其他'),
)

#应用服务类型代码
APPType = (
    (1,u'内部应用'),
    (2,u'电信业务'),
    (3,u'对外应用服务'),
    (999,u'其他'),
)

#备案属性代码表
BeiAn = (
    (0,u'无'),
    (1,u'经营性网站（ ICP经营许可证号）'),
    (2,u'非经营性网站（备案登记号）'),
    (3,u'SP（备案登记号）'),
    (4,u'BBS（ BBS备案号）'),
    (999,u'其他'),
)



